Documents/ПланированиеВходящихКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПланированиеВходящихКонтактов</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>План</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаПродаж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Январь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Февраль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Март</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Апрель</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Май</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июнь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Июль</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Август</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сентябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Октябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ноябрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Декабрь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПланВходящихКонтактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПланВходящихКонтактов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТочкиПродаж</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ПланированиеВходящихКонтактов/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//проверим, был ли введен по данному году документ ранее
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПланированиеВходящихКонтактов.Ссылка
	|ИЗ
	|	Документ.ПланированиеВходящихКонтактов КАК ПланированиеВходящихКонтактов
	|ГДЕ
	|	ПланированиеВходящихКонтактов.Год = &Год
	|	И ПланированиеВходящихКонтактов.Проведен = ИСТИНА
	|	И ПланированиеВходящихКонтактов.Ссылка <> &Ссылка";
	Запрос.УстановитьПараметр("Год",Год);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	ВыборкаЗапроса = Запрос.Выполнить().Выбрать();
	Пока ВыборкаЗапроса.Следующий() Цикл
		Отказ = Истина;
		Сообщить("По данному году уже имеется проведенный документ плана: " + ВыборкаЗапроса.Ссылка,СтатусСообщения.Важное);
	КонецЦикла;
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	
	Для Каждого СтрокаПлан Из План Цикл
		
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 1, СтрокаПлан.Январь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 2, СтрокаПлан.Февраль);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 3, СтрокаПлан.Март);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 4, СтрокаПлан.Апрель);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 5, СтрокаПлан.Май);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 6, СтрокаПлан.Июнь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 7, СтрокаПлан.Июль);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 8, СтрокаПлан.Август);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 9, СтрокаПлан.Сентябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 10, СтрокаПлан.Октябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 11, СтрокаПлан.Ноябрь);
		РегистрыСведений.ПланВходящихКонтактов.ЗаписатьДанныеВПланВходящихКонтактов(СтрокаПлан.ТочкаПродаж, Год, 12, СтрокаПлан.Декабрь);
				
	КонецЦикла;
	
КонецПроцедуры
